# 元组， 类似于list,或者说是不可更改的list
# 元组只是不可以利用元组下标来更改元素，但是通过更改元素内容来改变元组
'''
总结:元组
1.创建：(),注意空和一个元素的创建
2.增：不能增
3.删：只能删除整个元组
4.改：不可改变内容
5.+/*--拼接成新的元组
6.查：当个元素访问


'''

# 元组的创建
t = ('Google', 'Runoob', 1997, 2000)
print(t)

# 空元组的创建
t1 = ()
print(t1)

# 一个元素的元组的创建
t2 = (50,)
print(t2)

# 访问元组--下标访问
t1 = (1, 2, 3, 4, 5, 6, 7)
print('t[0] = ', t[0])
print('t1[1:5] = ', t1[1:5])   # 截取子元组

# 修改元组--链接,元组的内容无法修改，但是可以将两个元组+形成新的元组
tup1 = (12, 34.46)
tup2 = ('abc', 'xyz')
tup3 = tup1 + tup2
print(tup3)

# 删除元组--删除整个元组,或者说引用被删除后，对应的内存没有引用计数也被删除
'''del t1
print(t1)'''

# 计算元组个数len(tuple), tuple(list)将List转化为元组
print('tup3的元素数目为: ', len(tup3), tup3)
l = [1, 2, 3, 4, 5, 6, 7]
tup4 = tuple(l)
print(tup4)

